Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/svd/PIC32CK0512GC01064.svd
               <register>
                  <name>COUNT0</name>
                  <description>ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO</description>
                  <addressOffset>0x1018</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EP0RXCOUNT</name>
                        <description>Number Of Received Data Bytes In Endpoint 0 FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TYPE0</name>
                  <description>ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device</description>
                  <addressOffset>0x101A</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Operating Speed Of The Target Device</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Device In High Speed</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <description>Device In Full Speed</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Device In Low Speed</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NAKLIMIT0</name>
                  <description>ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0.</description>
                  <addressOffset>0x101B</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EP0NAKLIMIT</name>
                        <description>Number Of Frames/Microframes After Which Endpoint 0 Should Timeout</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CONFIGDATA</name>
                  <description>ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected.</description>
                  <addressOffset>0x101F</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>UTMIDATAWIDTH</name>
                        <description>Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFTCONE</name>
                        <description>Indicates Soft Connect Or Disconnect</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DYNFIFOSIZING</name>
                        <description>Dynamic FIFO Sizing Is Selected Or Not</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HBTXE</name>
                        <description>Indicates High Bandwidth TX ISO Endpoint Support Selected</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HBRXE</name>
                        <description>Indicates High Bandwidth RX ISO Endpoint Support Selected</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BIGENDIAN</name>
                        <description>Indicates Little Endian Ordering</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MPTXE</name>
                        <description>Automatic Splitting Of Bulk Packets Is Selected</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MPRXE</name>
                        <description>Automatic Splitting Of Bulk Amalgamation Is Selected</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>8</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FIFOX[%s]</name>
                  <description>Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint</description>
                  <addressOffset>0x1020</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>FIFOADDR</name>
                        <description>Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DEVCTL</name>
                  <description>Selects Whether The Core Is Operating In Peripheral Or Host Mode</description>
                  <addressOffset>0x1060</addressOffset>
                  <size>8</size>
                  <resetValue>0x80</resetValue>
                  <fields>
                     <field>
                        <name>SESSION</name>
                        <description>when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HOSTREQ</name>
                        <description>when set, the USBCORE will initiate the host negotiation when suspend mode is entered.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HOSTMODE</name>
                        <description>this read-only bit is set when the USBCORE is acting as a host</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUS</name>
                        <description>encoded value for the VBus level</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>VBUSSelect</name>
                           <enumeratedValue>
                              <name>BSESSEND</name>
                              <description>Below SessionEnd</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ASESSEND</name>
                              <description>Above SessionEnd, below AValid</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AAVALID</name>
                              <description>Above AValid, below VBus Valid</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AVBUSVALID</name>
                              <description>Above VBusValid</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LSDEV</name>
                        <description>host mode only: this bit is set when a low speed device has been detected being connected to the port</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FSDEV</name>
                        <description>host mode only: this bit is set when a full or high speed device has been detected being connected to the port</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BDEVICE</name>
                        <description>indicates whether the core is operating as a 'A' device or 'B' device</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MISC</name>
                  <description>RX/TX Early DMA Enable Bits</description>
                  <addressOffset>0x1061</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXEDMA</name>
                        <description>DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>RXEDMASelect</name>
                           <enumeratedValue>
                              <name>MAXP</name>
                              <description>Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAXP_8</name>
                              <description>Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXEDMA</name>
                        <description>DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>TXEDMASelect</name>
                           <enumeratedValue>
                              <name>MAXP</name>
                              <description>Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MAXP_8</name>
                              <description>Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXFIFOSZ</name>
                  <description>Controls The Size Of The Selected TX Endpoint FIFO</description>
                  <addressOffset>0x1062</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SZ</name>
                        <description>maximum packet size to be allowed</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>SZSelect</name>
                           <enumeratedValue>
                              <name>8BYTES</name>
                              <description>8 BYTES</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16BYTES</name>
                              <description>16 BYTES</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>32BYTES</name>
                              <description>32 BYTES</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>64BYTES</name>
                              <description>64 BYTES</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>128BYTES</name>
                              <description>128 BYTES</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>256BYTES</name>
                              <description>256 BYTES</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>512BYTES</name>
                              <description>512 BYTES</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1024BYTES</name>
                              <description>1024 BYTES</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2048BYTES</name>
                              <description>2048 BYTES</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4096BYTES</name>
                              <description>4096 BYTES</description>
                              <value>0x9</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DPB</name>
                        <description>double packet buffering supported or not</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXFIFOSZ</name>
                  <description>Controls The Size Of The Selected RX Endpoint FIFO</description>
                  <addressOffset>0x1063</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SZ</name>
                        <description>maximum packet size to be allowed</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>SZSelect</name>
                           <enumeratedValue>
                              <name>8BYTES</name>
                              <description>8 BYTES</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16BYTES</name>
                              <description>16 BYTES</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>32BYTES</name>
                              <description>32 BYTES</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>64BYTES</name>
                              <description>64 BYTES</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>128BYTES</name>
                              <description>128 BYTES</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>256BYTES</name>
                              <description>256 BYTES</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>512BYTES</name>
                              <description>512 BYTES</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1024BYTES</name>
                              <description>1024 BYTES</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2048BYTES</name>
                              <description>2048 BYTES</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4096BYTES</name>
                              <description>4096 BYTES</description>
                              <value>0x9</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DPB</name>
                        <description>double packet buffering enabled or not</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXFIFOADD</name>
                  <description>Controls The Start Address Of the Selected TX Endpoint FIFO</description>
                  <addressOffset>0x1064</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>start address of the endpoint FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXFIFOADD</name>
                  <description>Controls The Start Address Of the Selected RX Endpoint FIFO</description>
                  <addressOffset>0x1066</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>start address of the endpoint FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPINFO</name>
                  <description>Allows Read-Back Of The Number Of TX And RX Endpoints</description>
                  <addressOffset>0x1078</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0xFF</resetValue>
                  <fields>
                     <field>
                        <name>TXENDPOINTS</name>
                        <description>number of tx endpoints</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RXENDPOINTS</name>
                        <description>number of rx endpoints</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
